app/controllers/api/v1/partners_controller.rb

INSERT INTO `partners` (`user_id`, `sexuality_id`, `min_age`, `max_age`, `created_at`, `updated_at`) VALUES (1, 2, 22, 28, '2015-06-08 10:34:23', '2015-06-08 10:34:23')
---
    def create
        @partner = Partner.new(partner_params)
        if @partner.save