app/controllers/api/v1/profiles_controller.rb

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
---
    def show
        @profile = Profile.find(params[:id])

INSERT INTO `profiles` (`birthday`, `gender`, `user_id`, `zodiac_id`, `style_id`, `created_at`, `updated_at`) VALUES ('1987-05-22', 1, 1, 3, 1, '2015-06-06 14:52:57', '2015-06-06 14:52:57')
---
    def create
        profile = Profile.find_by(user_id: params[:profile][:user_id])
        puts "user_id: #{params[:profile][:user_id]}, profile: #{profile}"
        if profile
            response = {'profile_id' => profile.id}
            render json: response, status: 200
            return;
        end
        @profile = Profile.new(profile_params)
        if @profile.save

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
UPDATE `profiles` SET `birthday` = '1987-05-23', `gender` = 0, `zodiac_id` = 1, `style_id` = 3, `updated_at` = '2015-06-06 15:22:34' WHERE `profiles`.`id` = 1
---
    def update
        @profile = Profile.find(params[:id])
        if @profile.update_attributes(profile_params)