app/controllers/api/v1/sessions_controller.rb

    def create
        @user = User.find_by(email: params[:session][:email].downcase)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'wukun@biulove.com' LIMIT 1