app/controllers/api/v1/users_controller.rb

INSERT INTO `users` (`username`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('tony', 'wukun@biulove.com', '$2a$10$791LD5QpeCcHl5YO8bxTC.duvbb5MznD2X1ItwtJMEQy3jT86Vmxe', '2015-05-21 03:31:59', '2015-05-21 03:31:59')
---
    def create
        @user = User.new(username: params[:username], email: params[:email],
                        password: params[:password], password_confirmation: params[:password_confirmation])
        if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'wukun@biulove.com' LIMIT 1
---
    def search
        @user = User.find_by(email: params[:email].downcase)